zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_can.h
 /**   
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_can.h
  * @author  FMSH Application Team
  * @brief   Head file of CAN FL Module 
  *******************************************************************************************************   
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_CAN_H
#define __FM33FG0XXA_FL_CAN_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_ES_INIT CAN Exported Init structures
  * @{
  */

/**
  * @brief FL CAN Init Sturcture definition
  */
typedef struct
{
    /*工作模式*/
    uint8_t mode;
    /*同步段长度*/
    uint8_t SJW;
    /*时间段1*/
    uint8_t TS1;
    /*时间段2*/
    uint8_t TS2;
    /*波特率预分频*/
    uint32_t BRP;
    /*时钟源选择*/
    uint32_t clockSource;
    /*发送优先级选择*/
    uint32_t TXPriority;
    /*唤醒使能*/
    FL_FunState wakeup;
    /*自动总线管理*/
    uint32_t ABOM;
    /*自动重发使能*/
    FL_FunState AREN;
} FL_CAN_InitTypeDef;
/**
  * @brief  CAN filter init structure definition
  */
typedef struct
{

    /*32位滤波器SRR位*/
    uint32_t filterIdSRR;
    /*32位滤波器IDE位*/
    uint32_t filterIdIDE;
    /*32位滤波器RTR位*/
    uint32_t filterIdRTR;
    /*32位滤波器标准ID*/
    uint32_t filterIdStandard;
    /*32位滤波器扩展ID*/
    uint32_t filterIdExtend;

    /*16位滤波器1IDE位*/
    uint32_t filterSTD1IdIDE;
    /*16位滤波器1SRR位*/
    uint32_t filterSTD1IdSRR;
    /*16位滤波器1标准ID*/
    uint32_t filterSTD1IdStandard;
    /*16位滤波器1扩展ID*/
    uint32_t filterSTD1IdExtend;

    /*16位滤波器2IDE位*/
    uint32_t filterSTD2IdIDE;
    /*16位滤波器2SRR位*/
    uint32_t filterSTD2IdSRR;
    /*16位滤波器2标准ID*/
    uint32_t filterSTD2IdStandard;
    /*16位滤波器2扩展ID*/
    uint32_t filterSTD2IdExtend;

    /*32位滤波器SRR位掩码*/
    FL_FunState filterMaskIdSRR;
    /*32位滤波器IDE位掩码*/
    FL_FunState filterMaskIdIDE;
    /*32位滤波器RTR位掩码*/
    FL_FunState filterMaskIdRTR;
    /*32位滤波器标准ID掩码*/
    uint32_t filterMaskIdStandard;
    /*32位滤波器扩展ID掩码*/
    uint32_t filterMaskIdExtend;

    /*16位滤波器1IDE位掩码*/
    FL_FunState filterSTD1MaskIdIDE;
    /*16位滤波器1SRR位掩码*/
    FL_FunState filterSTD1MaskIdSRR;
    /*16位滤波器1标准ID掩码*/
    uint32_t filterSTD1MaskIdStandard;
    /*16位滤波器1扩展ID掩码*/
    uint32_t filterSTD1MaskIdExtend;

    /*16位滤波器2IDE位掩码*/
    FL_FunState filterSTD2MaskIdIDE;
    /*16位滤波器2SRR位掩码*/
    FL_FunState filterSTD2MaskIdSRR;
    /*16位滤波器2标准ID掩码*/
    uint32_t filterSTD2MaskIdStandard;
    /*16位滤波器2扩展ID掩码*/
    uint32_t filterSTD2MaskIdExtend;

    /*掩码寄存器使用模式：用作掩码或用作ID*/
    uint32_t filterMaskMode;
    /*ID寄存器扩展模式：32bit扩展模式或16bit标准模式*/
    uint32_t filterIDMode;
    /*滤波器使能*/
    FL_FunState  filterEn;
} FL_CAN_FilterInitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_Exported_Constants CAN Exported Constants
  * @{
  */

#define    CAN_CR_CEN_Pos                                         (1U)
#define    CAN_CR_CEN_Msk                                         (0x1U << CAN_CR_CEN_Pos)
#define    CAN_CR_CEN                                             CAN_CR_CEN_Msk

#define    CAN_CR_SRST_Pos                                        (0U)
#define    CAN_CR_SRST_Msk                                        (0x1U << CAN_CR_SRST_Pos)
#define    CAN_CR_SRST                                            CAN_CR_SRST_Msk

#define    CAN_MSR_RX_PRESYNC_EN_Pos                              (13U)
#define    CAN_MSR_RX_PRESYNC_EN_Msk                              (0x1U << CAN_MSR_RX_PRESYNC_EN_Pos)
#define    CAN_MSR_RX_PRESYNC_EN                                  CAN_MSR_RX_PRESYNC_EN_Msk

#define    CAN_MSR_TPRI_Pos                                       (12U)
#define    CAN_MSR_TPRI_Msk                                       (0x1U << CAN_MSR_TPRI_Pos)
#define    CAN_MSR_TPRI                                           CAN_MSR_TPRI_Msk

#define    CAN_MSR_WUPE_Pos                                       (11U)
#define    CAN_MSR_WUPE_Msk                                       (0x1U << CAN_MSR_WUPE_Pos)
#define    CAN_MSR_WUPE                                           CAN_MSR_WUPE_Msk

#define    CAN_MSR_AREN_Pos                                       (10U)
#define    CAN_MSR_AREN_Msk                                       (0x1U << CAN_MSR_AREN_Pos)
#define    CAN_MSR_AREN                                           CAN_MSR_AREN_Msk

#define    CAN_MSR_ABOM_Pos                                       (8U)
#define    CAN_MSR_ABOM_Msk                                       (0x3U << CAN_MSR_ABOM_Pos)
#define    CAN_MSR_ABOM                                           CAN_MSR_ABOM_Msk

#define    CAN_MSR_RTBO_Pos                                       (7U)
#define    CAN_MSR_RTBO_Msk                                       (0x1U << CAN_MSR_RTBO_Pos)
#define    CAN_MSR_RTBO                                           CAN_MSR_RTBO_Msk

#define    CAN_MSR_LPBACK_Pos                                     (1U)
#define    CAN_MSR_LPBACK_Msk                                     (0x1U << CAN_MSR_LPBACK_Pos)
#define    CAN_MSR_LPBACK                                         CAN_MSR_LPBACK_Msk

#define    CAN_MSR_SLEEP_Pos                                      (0U)
#define    CAN_MSR_SLEEP_Msk                                      (0x1U << CAN_MSR_SLEEP_Pos)
#define    CAN_MSR_SLEEP                                          CAN_MSR_SLEEP_Msk

#define    CAN_BRPR_BRP_Pos                                       (0U)
#define    CAN_BRPR_BRP_Msk                                       (0xffU << CAN_BRPR_BRP_Pos)
#define    CAN_BRPR_BRP                                           CAN_BRPR_BRP_Msk

#define    CAN_BTR_SJW_Pos                                        (7U)
#define    CAN_BTR_SJW_Msk                                        (0x3U << CAN_BTR_SJW_Pos)
#define    CAN_BTR_SJW                                            CAN_BTR_SJW_Msk

