zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_can.h
#define    CAN_RX_ISR_RXOFLW_Pos                                  (6U)
#define    CAN_RX_ISR_RXOFLW_Msk                                  (0x1U << CAN_RX_ISR_RXOFLW_Pos)
#define    CAN_RX_ISR_RXOFLW                                      CAN_RX_ISR_RXOFLW_Msk

#define    CAN_RX_ISR_RXUFLW_Pos                                  (5U)
#define    CAN_RX_ISR_RXUFLW_Msk                                  (0x1U << CAN_RX_ISR_RXUFLW_Pos)
#define    CAN_RX_ISR_RXUFLW                                      CAN_RX_ISR_RXUFLW_Msk

#define    CAN_RX_ISR_RXOK_Pos                                    (4U)
#define    CAN_RX_ISR_RXOK_Msk                                    (0x1U << CAN_RX_ISR_RXOK_Pos)
#define    CAN_RX_ISR_RXOK                                        CAN_RX_ISR_RXOK_Msk

#define    CAN_RX_ISR_ARBLST_Pos                                  (0U)
#define    CAN_RX_ISR_ARBLST_Msk                                  (0x1U << CAN_RX_ISR_ARBLST_Pos)
#define    CAN_RX_ISR_ARBLST                                      CAN_RX_ISR_ARBLST_Msk

#define    CAN_RX_IER_BORFIE_Pos                                  (12U)
#define    CAN_RX_IER_BORFIE_Msk                                  (0x1U << CAN_RX_IER_BORFIE_Pos)
#define    CAN_RX_IER_BORFIE                                      CAN_RX_IER_BORFIE_Msk

#define    CAN_RX_IER_WKUPIE_Pos                                  (11U)
#define    CAN_RX_IER_WKUPIE_Msk                                  (0x1U << CAN_RX_IER_WKUPIE_Pos)
#define    CAN_RX_IER_WKUPIE                                      CAN_RX_IER_WKUPIE_Msk

#define    CAN_RX_IER_SLPIE_Pos                                   (10U)
#define    CAN_RX_IER_SLPIE_Msk                                   (0x1U << CAN_RX_IER_SLPIE_Pos)
#define    CAN_RX_IER_SLPIE                                       CAN_RX_IER_SLPIE_Msk

#define    CAN_RX_IER_EESCFIE_Pos                                 (9U)
#define    CAN_RX_IER_EESCFIE_Msk                                 (0x1U << CAN_RX_IER_EESCFIE_Pos)
#define    CAN_RX_IER_EESCFIE                                     CAN_RX_IER_EESCFIE_Msk

#define    CAN_RX_IER_ERRORIE_Pos                                 (8U)
#define    CAN_RX_IER_ERRORIE_Msk                                 (0x1U << CAN_RX_IER_ERRORIE_Pos)
#define    CAN_RX_IER_ERRORIE                                     CAN_RX_IER_ERRORIE_Msk

#define    CAN_RX_IER_RXNEMPIE_Pos                                (7U)
#define    CAN_RX_IER_RXNEMPIE_Msk                                (0x1U << CAN_RX_IER_RXNEMPIE_Pos)
#define    CAN_RX_IER_RXNEMPIE                                    CAN_RX_IER_RXNEMPIE_Msk

#define    CAN_RX_IER_RXOFLWIE_Pos                                (6U)
#define    CAN_RX_IER_RXOFLWIE_Msk                                (0x1U << CAN_RX_IER_RXOFLWIE_Pos)
#define    CAN_RX_IER_RXOFLWIE                                    CAN_RX_IER_RXOFLWIE_Msk

#define    CAN_RX_IER_RXUFLWIE_Pos                                (5U)
#define    CAN_RX_IER_RXUFLWIE_Msk                                (0x1U << CAN_RX_IER_RXUFLWIE_Pos)
#define    CAN_RX_IER_RXUFLWIE                                    CAN_RX_IER_RXUFLWIE_Msk

#define    CAN_RX_IER_RXOKIE_Pos                                  (4U)
#define    CAN_RX_IER_RXOKIE_Msk                                  (0x1U << CAN_RX_IER_RXOKIE_Pos)
#define    CAN_RX_IER_RXOKIE                                      CAN_RX_IER_RXOKIE_Msk

#define    CAN_RX_IER_ARBLSTIE_Pos                                (0U)
#define    CAN_RX_IER_ARBLSTIE_Msk                                (0x1U << CAN_RX_IER_ARBLSTIE_Pos)
#define    CAN_RX_IER_ARBLSTIE                                    CAN_RX_IER_ARBLSTIE_Msk

#define    CAN_TXBCR_TXAR_Pos                                     (8U)
#define    CAN_TXBCR_TXAR_Msk                                     (0x7U << CAN_TXBCR_TXAR_Pos)
#define    CAN_TXBCR_TXAR                                         CAN_TXBCR_TXAR_Msk

#define    CAN_TXBCR_TXIE_Pos                                     (0U)
#define    CAN_TXBCR_TXIE_Msk                                     (0x7U << CAN_TXBCR_TXIE_Pos)
#define    CAN_TXBCR_TXIE                                         CAN_TXBCR_TXIE_Msk

#define    CAN_TXBSR_TXRF_Pos                                     (8U)
#define    CAN_TXBSR_TXRF_Msk                                     (0x3U << CAN_TXBSR_TXRF_Pos)
#define    CAN_TXBSR_TXRF                                         CAN_TXBSR_TXRF_Msk

#define    CAN_TXBSR_TXS_Pos                                      (3U)
#define    CAN_TXBSR_TXS_Msk                                      (0x7U << CAN_TXBSR_TXS_Pos)
#define    CAN_TXBSR_TXS                                          CAN_TXBSR_TXS_Msk

#define    CAN_TXBSR_TXE0_Pos                                      (0U)
#define    CAN_TXBSR_TXE0_Msk                                      (0x1U << CAN_TXBSR_TXE0_Pos)
#define    CAN_TXBSR_TXE0                                          CAN_TXBSR_TXE0_Msk

#define    CAN_TXBSR_TXE1_Pos                                      (1U)
#define    CAN_TXBSR_TXE1_Msk                                      (0x1U << CAN_TXBSR_TXE1_Pos)
#define    CAN_TXBSR_TXE1                                          CAN_TXBSR_TXE1_Msk

#define    CAN_TXBSR_TXE2_Pos                                      (2U)
#define    CAN_TXBSR_TXE2_Msk                                      (0x1U << CAN_TXBSR_TXE2_Pos)
#define    CAN_TXBSR_TXE2                                          CAN_TXBSR_TXE2_Msk


#define    CAN_TXBIDR_IDR_Pos                                     (0U)
#define    CAN_TXBIDR_IDR_Msk                                     (0xffffffffU << CAN_TXBIDR_IDR_Pos)
#define    CAN_TXBIDR_IDR                                         CAN_TXBIDR_IDR_Msk

#define    CAN_TXBDLCR_DLC_Pos                                    (0U)
#define    CAN_TXBDLCR_DLC_Msk                                    (0xfU << CAN_TXBDLCR_DLC_Pos)
#define    CAN_TXBDLCR_DLC                                        CAN_TXBDLCR_DLC_Msk

#define    CAN_TXBDW1R_DB_Pos                                     (0U)
#define    CAN_TXBDW1R_DB_Msk                                     (0xffffffffU << CAN_TXBDW1R_DB_Pos)
#define    CAN_TXBDW1R_DB                                         CAN_TXBDW1R_DB_Msk

#define    CAN_TXBDW2R_DB_Pos                                     (0U)
#define    CAN_TXBDW2R_DB_Msk                                     (0xffffffffU << CAN_TXBDW2R_DB_Pos)
#define    CAN_TXBDW2R_DB                                         CAN_TXBDW2R_DB_Msk

