zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_can.h
#define    CAN_AFIRSTD1_AIID3_Pos                                  (13U)
#define    CAN_AFIRSTD1_AIID3_Msk                                  (0x7U << CAN_AFIRSTD1_AIID3_Pos)
#define    CAN_AFIRSTD1_AIID3                                      CAN_AFIRSTD1_AIID3_Msk

#define    CAN_AFIRSTD1_AIIDE_Pos                                  (12U)
#define    CAN_AFIRSTD1_AIIDE_Msk                                  (0x1U << CAN_AFIRSTD1_AIIDE_Pos)
#define    CAN_AFIRSTD1_AIIDE                                      CAN_AFIRSTD1_AIIDE_Msk

#define    CAN_AFIRSTD1_AISRR_Pos                                  (11U)
#define    CAN_AFIRSTD1_AISRR_Msk                                  (0x1U << CAN_AFIRSTD1_AISRR_Pos)
#define    CAN_AFIRSTD1_AISRR                                      CAN_AFIRSTD1_AISRR_Msk

#define    CAN_AFIRSTD1_AIID11_Pos                                 (0U)
#define    CAN_AFIRSTD1_AIID11_Msk                                 (0x7ffU << CAN_AFIRSTD1_AIID11_Pos)
#define    CAN_AFIRSTD1_AIID11                                     CAN_AFIRSTD1_AIID11_Msk



#define    FL_CAN_SOFTWARE_NO_RESET                               (0x0U << CAN_CR_SRST_Pos)
#define    FL_CAN_SOFTWARE_RESET                                  (0x1U << CAN_CR_SRST_Pos)


#define    FL_CAN_TX_PRIORITY_ID                                  (0x0U << CAN_MSR_TPRI_Pos)
#define    FL_CAN_TX_PRIORITY_BUFFER                              (0x1U << CAN_MSR_TPRI_Pos)


#define    FL_CAN_AUTO_MANAGE_HARDWARE                            (0x0U << CAN_MSR_ABOM_Pos)
#define    FL_CAN_AUTO_MANAGE_SOFTWARE_WAIT                       (0x1U << CAN_MSR_ABOM_Pos)
#define    FL_CAN_AUTO_MANAGE_SOFTWARE_INTERGRATION               (0x2U << CAN_MSR_ABOM_Pos)


#define    FL_CAN_RX_STATUS_NORMAL                                (0x0U << CAN_SR_RSTS_Pos)
#define    FL_CAN_RX_STATUS_WARNING                               (0x1U << CAN_SR_RSTS_Pos)
#define    FL_CAN_RX_STATUS_ERROR                                 (0x2U << CAN_SR_RSTS_Pos)
#define    FL_CAN_RX_STATUS_BUSOFF                               (0x3U << CAN_SR_RSTS_Pos)

#define    FL_CAN_TX_STATUS_NORMAL                                (0x0U << CAN_SR_TSTS_Pos)
#define    FL_CAN_TX_STATUS_WARNING                               (0x1U << CAN_SR_TSTS_Pos)
#define    FL_CAN_TX_STATUS_ERROR                                 (0x2U << CAN_SR_TSTS_Pos)
#define    FL_CAN_TX_STATUS_BUSOFF                               (0x3U << CAN_SR_TSTS_Pos)

#define    FL_CAN_TX_ABORT_NONE                                   (0x0U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_0                               (0x1U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_1                               (0x2U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_0AND1                           (0x3U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_2                               (0x4U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_0AND2                           (0x5U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_BUFFER_1AND2                           (0x6U << CAN_TXBCR_TXAR_Pos)
#define    FL_CAN_TX_ABORT_ALL                                    (0x7U << CAN_TXBCR_TXAR_Pos)


#define    FL_CAN_TX_RESULT_NONE                                  (0x0U << CAN_TXBSR_TXRF_Pos)
#define    FL_CAN_TX_RESULT_ABORT                                 (0x1U << CAN_TXBSR_TXRF_Pos)
#define    FL_CAN_TX_RESULT_OK_NOABORT                            (0x2U << CAN_TXBSR_TXRF_Pos)
#define    FL_CAN_TX_RESULT_OK_ABORT                              (0x3U << CAN_TXBSR_TXRF_Pos)

#define    FL_CAN_TX_BUFFER_ALL_IDLE                              (0x0U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_0_BUSY                                (0x1U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_1_BUSY                                (0x2U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_0AND1_BUSY                            (0x3U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_2_BUSY                                (0x4U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_0AND2_BUSY                            (0x5U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_1AND2_BUSY                            (0x6U << CAN_TXBSR_TXS_Pos)
#define    FL_CAN_TX_BUFFER_ALL_BUSY                              (0x7U << CAN_TXBSR_TXS_Pos)

#define    FL_CAN_RTR_BIT_LOW                                     (0x0U << CAN_AFIR_AIRTR_Pos)
#define    FL_CAN_RTR_BIT_HIGH                                    (0x1U << CAN_AFIR_AIRTR_Pos)


#define    FL_CAN_IDE_BIT_LOW                                     (0x0U << CAN_AFIR_AIIDE_Pos)
#define    FL_CAN_IDE_BIT_HIGH                                    (0x1U << CAN_AFIR_AIIDE_Pos)


#define    FL_CAN_SRR_BIT_LOW                                     (0x0U << CAN_AFIR_AISRR_Pos)
#define    FL_CAN_SRR_BIT_HIGH                                    (0x1U << CAN_AFIR_AISRR_Pos)

#define    FL_CAN_STD1IDE_BIT_LOW                               (0x0U << CAN_AFIRSTD1_AIIDE_Pos)
#define    FL_CAN_STD1IDE_BIT_HIGH                              (0x1U << CAN_AFIRSTD1_AIIDE_Pos)

#define    FL_CAN_STD1SRR_BIT_LOW                               (0x0U << CAN_AFIRSTD1_AISRR_Pos)
#define    FL_CAN_STD1SRR_BIT_HIGH                              (0x1U << CAN_AFIRSTD1_AISRR_Pos)

#define    FL_CAN_STD2IDE_BIT_LOW                               (0x0U << CAN_AFIRSTD2_AIIDE_Pos)
#define    FL_CAN_STD2IDE_BIT_HIGH                              (0x1U << CAN_AFIRSTD2_AIIDE_Pos)

#define    FL_CAN_STD2SRR_BIT_LOW                               (0x0U << CAN_AFIRSTD2_AISRR_Pos)
#define    FL_CAN_STD2SRR_BIT_HIGH                              (0x1U << CAN_AFIRSTD2_AISRR_Pos)


#define    FL_CAN_MASKMODE_ID                                     (0x1U << CAN_AFCFGR_MSKM_Pos)
#define    FL_CAN_MASKMODE_MASK                                   (0x0U << CAN_AFCFGR_MSKM_Pos)

#define    FL_CAN_IDMODE_16BIT                                     (0x1U << CAN_AFCFGR_FSC_Pos)
#define    FL_CAN_IDMODE_32BIT                                     (0x0U << CAN_AFCFGR_FSC_Pos)

#define    FL_CAN_FILTER1                                         0x0U
#define    FL_CAN_FILTER2                                         0x1U
#define    FL_CAN_FILTER3                                         0x2U
#define    FL_CAN_FILTER4                                         0x3U
#define    FL_CAN_FILTER5                                         0x4U
#define    FL_CAN_FILTER6                                         0x5U
#define    FL_CAN_FILTER7                                         0x6U
#define    FL_CAN_FILTER8                                         0x7U
#define    FL_CAN_FILTER9                                         0x8U
#define    FL_CAN_FILTER10                                        0x9U
#define    FL_CAN_FILTER11                                        0xAU
#define    FL_CAN_FILTER12                                        0xBU
#define    FL_CAN_FILTER13                                        0xCU
#define    FL_CAN_FILTER14                                        0xDU
#define    FL_CAN_FILTER15                                        0xEU
#define    FL_CAN_FILTER16                                        0xFU

#define    FL_CAN_BUFFER0                                         0x1U<<0U
#define    FL_CAN_BUFFER1                                         0x1U<<1U
#define    FL_CAN_BUFFER2                                         0x1U<<2U



