zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_can.h
#define FL_CAN_TS1_1Tq  0U
#define FL_CAN_TS1_2Tq  1U
#define FL_CAN_TS1_3Tq  2U
#define FL_CAN_TS1_4Tq  3U
#define FL_CAN_TS1_5Tq  4U
#define FL_CAN_TS1_6Tq  5U
#define FL_CAN_TS1_7Tq  6U
#define FL_CAN_TS1_8Tq  7U
#define FL_CAN_TS1_9Tq  8U
#define FL_CAN_TS1_10Tq  9U
#define FL_CAN_TS1_11Tq  10U
#define FL_CAN_TS1_12Tq  11U
#define FL_CAN_TS1_13Tq  12U
#define FL_CAN_TS1_14Tq  13U
#define FL_CAN_TS1_15Tq  14U
#define FL_CAN_TS1_16Tq  15U

#define FL_CAN_TS2_1Tq  0U
#define FL_CAN_TS2_2Tq  1U
#define FL_CAN_TS2_3Tq  2U
#define FL_CAN_TS2_4Tq  3U
#define FL_CAN_TS2_5Tq  4U
#define FL_CAN_TS2_6Tq  5U
#define FL_CAN_TS2_7Tq  6U
#define FL_CAN_TS2_8Tq  7U


#define FL_CAN_SJW_1Tq  0U
#define FL_CAN_SJW_2Tq  1U
#define FL_CAN_SJW_3Tq  2U
#define FL_CAN_SJW_4Tq  3U

#define FL_CAN_MODE_NORMAL    0U
#define FL_CAN_MODE_LOOPBACK  1U
#define FL_CAN_MODE_CONFIG    2U
#define FL_CAN_MODE_SLEEP     3U



#define FL_CAN_FORMAT_STANDARD_DATA    0
#define FL_CAN_FORMAT_STANDARD_REMOTE  1
#define FL_CAN_FORMAT_EXTEND_DATA      2
#define FL_CAN_FORMAT_EXTEND_REMOTE    3

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_Exported_Functions CAN Exported Functions
  * @{
  */

/**
  * @brief    CAN enable
  * @rmtoll   CR    CEN    FL_CAN_Enable
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Enable(CAN_Type* CANx)
{
    SET_BIT(CANx->CR, CAN_CR_CEN_Msk);
}

/**
  * @brief    Get CAN enable status 
  * @rmtoll   CR    CEN    FL_CAN_IsEnabled
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabled(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->CR, CAN_CR_CEN_Msk) == CAN_CR_CEN_Msk);
}

/**
  * @brief    CAN disable
  * @rmtoll   CR    CEN    FL_CAN_Disable
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Disable(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->CR, CAN_CR_CEN_Msk);
}

/**
  * @brief    Set CAN software reset
  * @rmtoll   CR    SRST    FL_CAN_EnableSoftwareReset
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableSoftwareReset(CAN_Type *CANx)
{
    SET_BIT(CANx->CR, CAN_CR_SRST_Msk);
}

/**
  * @brief    Rx Presync enable
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_CAN_EnableRXPresync
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableRXPresync(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Rx Presync disable
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_CAN_DisableRXPresync
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableRXPresync(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Get Rx Presync enable status
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_CAN_IsEnabledRXPresync
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledRXPresync(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_RX_PRESYNC_EN_Msk) == CAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Set TX priority
  * @rmtoll   MSR    TPRI    FL_CAN_SetTXPriority
  * @param    CANx CAN instance
  * @param    priority This parameter can be one of the following values:
  *           @arg @ref FL_CAN_TX_PRIORITY_ID
  *           @arg @ref FL_CAN_TX_PRIORITY_BUFFER
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_SetTXPriority(CAN_Type* CANx, uint32_t priority)
{
    MODIFY_REG(CANx->MSR, CAN_MSR_TPRI_Msk, priority);
}

/**
  * @brief    Get Tx priority
  * @rmtoll   MSR    TPRI    FL_CAN_GetTXPriority
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_TX_PRIORITY_ID
  *           @arg @ref FL_CAN_TX_PRIORITY_BUFFER
  */
__STATIC_INLINE uint32_t FL_CAN_GetTXPriority(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_TPRI_Msk));
}

/**
  * @brief    wakeup enable
  * @rmtoll   MSR    WUPE    FL_CAN_EnableWakeup
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableWakeup(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_WUPE_Msk);
}

/**
  * @brief    wakeup disable
  * @rmtoll   MSR    WUPE    FL_CAN_DisableWakeup
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableWakeup(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_WUPE_Msk);
}

/**
  * @brief    Get wakeup enable status
  * @rmtoll   MSR    WUPE    FL_CAN_IsEnabledWakeup
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledWakeup(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_WUPE_Msk) == CAN_MSR_WUPE_Msk);
}

/**
  * @brief    Auto resend enable
  * @rmtoll   MSR    AREN    FL_CAN_EnableAutoResend
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableAutoResend(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_AREN_Msk);
}

/**
  * @brief    Auto resend disable
  * @rmtoll   MSR    AREN    FL_CAN_DisableAutoResend
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableAutoResend(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_AREN_Msk);
}

/**
  * @brief    Get Auto resend enable status
  * @rmtoll   MSR    AREN    FL_CAN_IsEnabledAutoResend
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledAutoResend(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_AREN_Msk) == CAN_MSR_AREN_Msk);
}

/**
  * @brief    Set auto bus off management
  * @rmtoll   MSR    ABOM    FL_CAN_SetAutoBusOffManagement
  * @param    CANx CAN instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref FL_CAN_AUTO_MANAGE_HARDWARE
  *           @arg @ref FL_CAN_AUTO_MANAGE_SOFTWARE_WAIT
  *           @arg @ref FL_CAN_AUTO_MANAGE_SOFTWARE_INTEERGRATION
  *           @arg @ref FL_CAN_AUTO_MANAGE_HARDWARE
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_SetAutoBusOffManagement(CAN_Type* CANx, uint32_t state)
{
    MODIFY_REG(CANx->MSR, CAN_MSR_ABOM_Msk, state);
}

/**
  * @brief    Get auto bus off management
  * @rmtoll   MSR    ABOM    FL_CAN_GetAutoBusOffManagement
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_AUTO_MANAGE_HARDWARE
  *           @arg @ref FL_CAN_AUTO_MANAGE_SOFTWARE_WAIT
  *           @arg @ref FL_CAN_AUTO_MANAGE_SOFTWARE_INTEERGRATION
  *           @arg @ref FL_CAN_AUTO_MANAGE_HARDWARE
  */
__STATIC_INLINE uint32_t FL_CAN_GetAutoBusOffManagement(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_ABOM_Msk));
}

/**
  * @brief    Software exit busoff enable 
  * @rmtoll   MSR    RTBO    FL_CAN_EnableSoftwareExitBusoff
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableSoftwareExitBusoff(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_RTBO_Msk);
}

/**
  * @brief    Software exit busoff disable 
  * @rmtoll   MSR    RTBO    FL_CAN_DisableSoftwareExitBusoff
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableSoftwareExitBusoff(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_RTBO_Msk);
}

/**
  * @brief    Get software exit busoff enable status
  * @rmtoll   MSR    RTBO    FL_CAN_IsEnabledSoftwareExitBusoff
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledSoftwareExitBusoff(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_RTBO_Msk) == CAN_MSR_RTBO_Msk);
}

/**
  * @brief    Enable loop back mode
  * @rmtoll   MSR    LPBACK    FL_CAN_EnableLoopBackMode
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableLoopBackMode(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Disable loop back mode
  * @rmtoll   MSR    LPBACK    FL_CAN_DisableLoopBackMode
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableLoopBackMode(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Get loop back mode Enable Status
  * @rmtoll   MSR    LPBACK    FL_CAN_IsEnabledLoopBackMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledLoopBackMode(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk) == CAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Enable Sleep mode
  * @rmtoll   MSR    SLEEP    FL_CAN_EnableSleepMode
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableSleepMode(CAN_Type* CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Disable Sleep mode
  * @rmtoll   MSR    SLEEP    FL_CAN_DisableSleepMode
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableSleepMode(CAN_Type* CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Get Sleep mode Enable Status
  * @rmtoll   MSR    SLEEP    FL_CAN_IsEnabledSleepMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledSleepMode(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_SLEEP_Msk) == CAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Set baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_CAN_WriteBaudRatePrescaler
  * @param    CANx CAN instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteBaudRatePrescaler(CAN_Type* CANx, uint32_t psc)
{
    MODIFY_REG(CANx->BRPR, CAN_BRPR_BRP_Msk, (psc << CAN_BRPR_BRP_Pos));
}

/**
  * @brief    Get baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_CAN_ReadBaudRatePrescaler
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadBaudRatePrescaler(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->BRPR, CAN_BRPR_BRP_Msk) >> CAN_BRPR_BRP_Pos);
}

/**
  * @brief    Set synchronization jump width
  * @rmtoll   BTR    SJW    FL_CAN_WriteSyncJumpWidth
  * @param    CANx CAN instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteSyncJumpWidth(CAN_Type* CANx, uint32_t width)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_SJW_Msk, (width << CAN_BTR_SJW_Pos));
}

/**
  * @brief    Get synchronization jump width
  * @rmtoll   BTR    SJW    FL_CAN_ReadSyncJumpWidth
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadSyncJumpWidth(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_SJW_Msk) >> CAN_BTR_SJW_Pos);
}

/**
  * @brief    Set time segment2 length
  * @rmtoll   BTR    TS2    FL_CAN_WriteTimeSegment2Length
  * @param    CANx CAN instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTimeSegment2Length(CAN_Type* CANx, uint32_t length)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_TS2_Msk, (length << CAN_BTR_TS2_Pos));
}

/**
  * @brief    Get time segment2 length
  * @rmtoll   BTR    TS2    FL_CAN_ReadTimeSegment2Length
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTimeSegment2Length(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_TS2_Msk) >> CAN_BTR_TS2_Pos);
}

/**
  * @brief    Set time segment1 length
  * @rmtoll   BTR    TS1    FL_CAN_WriteTimeSegment1Length
  * @param    CANx CAN instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTimeSegment1Length(CAN_Type* CANx, uint32_t length)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_TS1_Msk, (length << CAN_BTR_TS1_Pos));
}

/**
  * @brief    Get time segment1 length
  * @rmtoll   BTR    TS1    FL_CAN_ReadTimeSegment1Length
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTimeSegment1Length(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_TS1_Msk) >> CAN_BTR_TS1_Pos);
}

/**
  * @brief    Get receive error number 
  * @rmtoll   ECR    REC    FL_CAN_ReadRXErrorCount
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXErrorCount(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ECR, CAN_ECR_REC_Msk) >> CAN_ECR_REC_Pos);
}

/**
  * @brief    Get transmit error number
  * @rmtoll   ECR    TEC    FL_CAN_ReadTXErrorCount
  * @param    CANx CAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXErrorCount(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ECR, CAN_ECR_TEC_Msk) >> CAN_ECR_TEC_Pos);
}

/**
  * @brief    Get Overload flag
  * @rmtoll   ESR    OVLF    FL_CAN_IsActiveFlag_Overload
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Overload(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_OVLF_Msk) == (CAN_ESR_OVLF_Msk));
}

/**
  * @brief    Clear Overload flag
  * @rmtoll   ESR    OVLF    FL_CAN_ClearFlag_Overload
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Overload(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_OVLF_Msk);
}

/**
  * @brief    Get Bus Lock flag
  * @rmtoll   ESR    BLF    FL_CAN_IsActiveFlag_Buslock
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Buslock(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_BLF_Msk) == (CAN_ESR_BLF_Msk));
}

/**
  * @brief    Clear Bus Lock flag
  * @rmtoll   ESR    BLF    FL_CAN_ClearFlag_Buslock
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Buslock(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_BLF_Msk);
}

/**
  * @brief    Get ACK Delimiter error flag
  * @rmtoll   ESR    ADERR    FL_CAN_IsActiveFlag_AckDelimiterError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_AckDelimiterError(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_ADERR_Msk) == (CAN_ESR_ADERR_Msk));
}

/**
  * @brief    Clear ACK Delimiter error flag
  * @rmtoll   ESR    ADERR    FL_CAN_ClearFlag_AckDelimiterError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_AckDelimiterError(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_ADERR_Msk);
}

/**
  * @brief    Get ACK error flag
  * @rmtoll   ESR    ACKER    FL_CAN_IsActiveFlag_AckError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_AckError(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_ACKER_Msk) == (CAN_ESR_ACKER_Msk));
}

/**
  * @brief    Clear ACK error flag
  * @rmtoll   ESR    ACKER    FL_CAN_ClearFlag_AckError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_AckError(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_ACKER_Msk);
}

/**
  * @brief    Get receive bit 0 error flag
  * @rmtoll   ESR    B0ERR    FL_CAN_IsActiveFlag_Bit0Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Bit0Error(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_B0ERR_Msk) == (CAN_ESR_B0ERR_Msk));
}

/**
  * @brief    Clear receive bit 0 error flag
  * @rmtoll   ESR    B0ERR    FL_CAN_ClearFlag_Bit0Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Bit0Error(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_B0ERR_Msk);
}

/**
  * @brief    Get receive bit 1 error flag
  * @rmtoll   ESR    B1ERR    FL_CAN_IsActiveFlag_Bit1Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Bit1Error(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_B1ERR_Msk) == (CAN_ESR_B1ERR_Msk));
}

/**
  * @brief    Clear receive bit 1 error flag
  * @rmtoll   ESR    B1ERR    FL_CAN_ClearFlag_Bit1Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Bit1Error(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_B1ERR_Msk);
}

/**
  * @brief    Get stuffing error flag
  * @rmtoll   ESR    STER    FL_CAN_IsActiveFlag_StuffError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_StuffError(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_STER_Msk) == (CAN_ESR_STER_Msk));
}

/**
  * @brief    Clear stuffing error flag
  * @rmtoll   ESR    STER    FL_CAN_ClearFlag_StuffError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_StuffError(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_STER_Msk);
}

/**
  * @brief    Get form error flag
  * @rmtoll   ESR    FMER    FL_CAN_IsActiveFlag_FormatError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_FormatError(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_FMER_Msk) == (CAN_ESR_FMER_Msk));
}

/**
  * @brief    Clear form error flag
  * @rmtoll   ESR    FMER    FL_CAN_ClearFlag_FormatError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_FormatError(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_FMER_Msk);
}

/**
  * @brief    Get CRC error fiag
  * @rmtoll   ESR    CRCER    FL_CAN_IsActiveFlag_CRCError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_CRCError(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_CRCER_Msk) == (CAN_ESR_CRCER_Msk));
}

/**
  * @brief    Clear CRC error flag
  * @rmtoll   ESR    CRCER    FL_CAN_ClearFlag_CRCError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_CRCError(CAN_Type* CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_CRCER_Msk);
}

/**
  * @brief    Get acceptance filter busy flag
  * @rmtoll   SR    ACFBSY    FL_CAN_IsActiveFlag_FilterBusy
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_FilterBusy(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_ACFBSY_Msk) == (CAN_SR_ACFBSY_Msk));
}

/**
  * @brief    Get transmit FIFO FULL interrupt flag 
  * @rmtoll   SR    RXFE    FL_CAN_IsActiveFlag_RXBuffEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXBufferEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_RXFE_Msk) == (CAN_SR_RXFE_Msk));
}

/**
  * @brief    Get RX error status
  * @rmtoll   SR    RSTS    FL_CAN_GetRXErrorStatus
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_RX_STATUS_NORMAL
  *           @arg @ref FL_CAN_RX_STATUS_WARNING
  *           @arg @ref FL_CAN_RX_STATUS_ERROR
  *           @arg @ref FL_CAN_RX_STATUS_BUS_OFF
  */
__STATIC_INLINE uint32_t FL_CAN_GetRXErrorStatus(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_RSTS_Msk));
}

/**
  * @brief    Get TX error status 
  * @rmtoll   SR    TSTS    FL_CAN_GetTXErrorStatus
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_TX_STATUS_NORMAL
  *           @arg @ref FL_CAN_TX_STATUS_WARNING
  *           @arg @ref FL_CAN_TX_STATUS_ERROR
  *           @arg @ref FL_CAN_TX_STATUS_BUS_OFF
  */
__STATIC_INLINE uint32_t FL_CAN_GetTXErrorStatus(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_TSTS_Msk));
}

/**
  * @brief    Get bus busy flag
  * @rmtoll   SR    BBSY    FL_CAN_IsActiveFlag_BusBusy
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusBusy(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_BBSY_Msk) == (CAN_SR_BBSY_Msk));
}

/**
  * @brief    Get bus IDLE flag 
  * @rmtoll   SR    BIDLE    FL_CAN_IsActiveFlag_BusIdle
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusIdle(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_BIDLE_Msk) == (CAN_SR_BIDLE_Msk));
}

/**
  * @brief    Get normal mode flag
  * @rmtoll   SR    NORMAL    FL_CAN_IsActiveFlag_NormalMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_NormalMode(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_NORMAL_Msk) == (CAN_SR_NORMAL_Msk));
}

/**
  * @brief    Get sleep mode flag 
  * @rmtoll   SR    SLEEP    FL_CAN_IsActiveFlag_Sleep
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_SleepMode(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_SLEEP_Msk) == (CAN_SR_SLEEP_Msk));
}

/**
  * @brief    Get loop back mode flag 
  * @rmtoll   SR    LBACK    FL_CAN_IsActiveFlag_LoopbackMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_LoopbackMode(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_LBACK_Msk) == (CAN_SR_LBACK_Msk));
}

/**
  * @brief    Get configuration mode flag
  * @rmtoll   SR    CONFIG    FL_CAN_IsActiveFlag_ConfigMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ConfigMode(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_CONFIG_Msk) == (CAN_SR_CONFIG_Msk));
}

/**
  * @brief    Get bus off recovery interrupt flag
  * @rmtoll   RX_ISR    BORF    FL_CAN_IsActiveFlag_BusOffRecovery
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusOffRecovery(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_BORF_Msk) == (CAN_RX_ISR_BORF_Msk));
}

/**
  * @brief    Clear bus off recovery interrupt flag
  * @rmtoll   RX_ISR    BORF    FL_CAN_ClearFlag_ErrorStatusChange
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_BusOffRecovery(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_BORF_Msk);
}

/**
  * @brief    Get wakeup interrupt flag
  * @rmtoll   RX_ISR    WUPF    FL_CAN_IsActiveFlag_Wakeup
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Wakeup(CAN_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_WUPF_Msk) == (CAN_RX_ISR_WUPF_Msk));
}

/**
  * @brief    Clear wakeup interrupt flag
  * @rmtoll   RX_ISR    WUPF    FL_CAN_ClearFlag_Wakeup
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Wakeup(CAN_Type* CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_WUPF_Msk);
}

/**
  * @brief    Get wakeup interrupt flag
  * @rmtoll   RX_ISR    SLPIF    FL_CAN_IsActiveFlag_Sleep
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Sleep(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_SLPIF_Msk) == (CAN_RX_ISR_SLPIF_Msk));
}

/**
  * @brief    Clear sleep interrupt flag
  * @rmtoll   RX_ISR    SLPIF    FL_CAN_ClearFlag_Sleep
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Sleep(CAN_Type* CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_SLPIF_Msk);
}

