zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_can.h
/**
  * @brief    Disable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterEXT_DisableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterEXT_DisableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMR_AMIDE_Msk);
}

/**
  * @brief    Get IDE participate filter compare Enable Status
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterEXT_IsEnabledIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterEXT_IsEnabledIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMR_AMIDE_Msk) == CAN_AFMR_AMIDE_Msk);
}

/**
  * @brief    Enable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD1_EnableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD1_EnableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMIDE_Msk);
}

/**
  * @brief    Disable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD1_DisableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD1_DisableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMIDE_Msk);
}

/**
  * @brief    Get IDE participate filter compare Enable Status
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD1_IsEnabledIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterSTD1_IsEnabledIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMIDE_Msk) == CAN_AFMRSTD1_AMIDE_Msk);
}

/**
  * @brief    Enable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD2_EnableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD2_EnableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMIDE_Msk);
}

/**
  * @brief    Disable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD2_DisableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD2_DisableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMIDE_Msk);
}

/**
  * @brief    Get IDE participate filter compare Enable Status
  * @rmtoll   AFMR    AMIDE    FL_CAN_FilterSTD2_IsEnabledIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterSTD2_IsEnabledIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMIDE_Msk) == CAN_AFMRSTD2_AMIDE_Msk);
}

/**
  * @brief    Enable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_EnableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterEXT_EnableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMR_AMSRR_Msk);
}

/**
  * @brief    Disable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_DisableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterEXT_DisableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMR_AMSRR_Msk);
}

/**
  * @brief    Get SRR participate filter compare Enable Status
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_IsEnabledSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterEXT_IsEnabledSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMR_AMSRR_Msk) == CAN_AFMR_AMSRR_Msk);
}


/**
  * @brief    Enable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD1_EnableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD1_EnableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMSRR_Msk);
}

/**
  * @brief    Disable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD1_DisableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD1_DisableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMSRR_Msk);
}

/**
  * @brief    Get SRR participate filter compare Enable Status
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD1_IsEnabledSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterSTD1_IsEnabledSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD1_AMSRR_Msk) == CAN_AFMRSTD1_AMSRR_Msk);
}


/**
  * @brief    Enable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD2_EnableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD2_EnableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMSRR_Msk);
}

/**
  * @brief    Disable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD2_DisableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD2_DisableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMSRR_Msk);
}

/**
  * @brief    Get SRR participate filter compare Enable Status
  * @rmtoll   AFMR    AMSRR    FL_CAN_FilterSTD2_IsEnabledSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_FilterSTD2_IsEnabledSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR1) + 2 * filterX), CAN_AFMRSTD2_AMSRR_Msk) == CAN_AFMRSTD2_AMSRR_Msk);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_CAN_FilterEXT_WriteIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterEXT_WriteIDCompareMask(CAN_Type *CANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(CANx->AFMR1)) + 2 * filterX), (0x7ffU << CAN_AFMR_AMID11_Pos), id11 << CAN_AFMR_AMID11_Pos);
}

/**
  * @brief    Get ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_CAN_FilterEXT_ReadIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_FilterEXT_ReadIDCompareMask(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(CANx->AFMR1)) + 2 * filterX), (0x7ffU << CAN_AFMR_AMID11_Pos)) >> CAN_AFMR_AMID11_Pos);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_CAN_FilterSTD1_WriteIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD1_WriteIDCompareMask(CAN_Type *CANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(CANx->AFMR1)) + 2 * filterX), (0x7ffU << CAN_AFMRSTD1_AMID11_Pos), id11 << CAN_AFMRSTD1_AMID11_Pos);
}

/**
  * @brief    Get ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_CAN_FilterSTD1_ReadIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_FilterSTD1_ReadIDCompareMask(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(CANx->AFMR1)) + 2 * filterX), (0x7ffU << CAN_AFMRSTD1_AMID11_Pos)) >> CAN_AFMRSTD1_AMID11_Pos);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_CAN_FilterSTD2_WriteIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_FilterSTD2_WriteIDCompareMask(CAN_Type *CANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(CANx->AFMR1)) + 2 * filterX), (0x7ffU << CAN_AFMRSTD2_AMID11_Pos), id11 << CAN_AFMRSTD2_AMID11_Pos);
}

